In [1]:
import pandas as pd

In [2]:
kospi_24 = pd.read_csv('../24.12_kospi200 -회사명,종목코드.csv', dtype={'종목코드':str})

In [3]:
kospi_24['종목코드']

0      005930
1      000660
2      373220
3      207940
4      005380
        ...
195    178920
196    006110
197    005420
198    271940
199    006650
Name: 종목코드, Length: 200, dtype: object

In [4]:
kospi200 = pd.read_csv('../코스피200ticker.csv', dtype={'ticker':str})

In [5]:
kospi200

     ticker  start_date    end_date
0    000030  2015-01-30  2019-01-31
1    000050  2015-06-30  2018-05-31
2    000060  2022-06-30  2022-12-29
3    000070  2015-01-30  2022-11-30
4    000080  2015-01-30  2024-12-30
..      ...         ...         ...
318  450080  2023-12-28  2024-12-30
319  454910  2024-06-28  2024-12-30
320  456040  2024-12-30  2024-12-30
321  457190  2024-06-28  2024-12-30
322  489790  2024-09-30  2024-12-30

[323 rows x 3 columns]

In [6]:
ticker200 = kospi200['ticker'].unique()

In [7]:
ticker24 = kospi_24['종목코드'].unique()

In [8]:
nonticker = []

for ticker in ticker200:
    if ticker not in ticker24:
        nonticker.append(ticker)

In [9]:
len(nonticker)

123

In [32]:
from pykrx import stock
 
stock.get_market_ticker_name('003600')

'SK'

In [38]:
stock.get_market_ticker_name('034730')

'SK'

In [39]:
stock.get_market_ticker_name('003600')

'SK'

In [15]:
noncompany = dict()

for ticker in nonticker:
    name = stock.get_market_ticker_name(ticker)
    noncompany[name] = ticker

In [20]:
df2 = pd.DataFrame(list(noncompany.items()), columns=['종목명', '종목코드'])

In [21]:
df2

           종목명    종목코드
0         우리은행  000030
1           경방  000050
2        메리츠화재  000060
3        삼양홀딩스  000070
4     하이트진로홀딩스  000140
..         ...     ...
118   화승엔터프라이즈  241590
119      쿠쿠홈시스  284740
120  HDC현대산업개발  294870
121        케이카  381970
122      LX홀딩스  383800

[123 rows x 2 columns]

In [25]:
df2.to_csv('../non코스피200.csv', index=False, encoding='utf-8-sig')